#### ColorWithTransparency Members

---

|  |
| --- |
| ColorWithTransparency Class   Constructors   Methods   Properties   See Also |

The  ColorWithTransparency  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ColorWithTransparency | color |
| Public method | ColorWithTransparency(UInt32, UInt32, UInt32, UInt32) | color |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ColorWithTransparency |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBlue | get blue |
| Public method | GetColor | get color |
| Public method | GetGreen | get green |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetRed | get red |
| Public method | GetTransparency | get transparency |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetBlue | set blue |
| Public method | SetColor | set color |
| Public method | SetGreen | set green |
| Public method | SetRed | set red |
| Public method | SetTransparency | set transparency |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ColorWithTransparency Class

Autodesk.Revit.DB Namespace